particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
void BleEventDispatcher::bleEventDispatchThread(void *context) {
    BleEventDispatcher* dispatcher = (BleEventDispatcher*)context;
    while (true) {
        uint8_t event;
        if (os_msg_recv(dispatcher->allEvtQueue_, &event, 0xFFFFFFFF) == true) {
            if (event == EVENT_IO_TO_APP) {
                T_IO_MSG message;
                if (os_msg_recv(dispatcher->ioEvtQueue_, &message, 0) == true) {
                    // Handled by application directly
                    dispatcher->handleIoMessage(message);
                }
            } else if (event == BLE_EVENT_STOP) {
                break;
            } else {
                // Handled by BT lib, which will finally invoke the registered callback.
                // Do not do time consuming stuff in the callbacks.
                gap_handle_msg(event);
            }
        }
    }
    os_thread_exit(nullptr);
}

int BleGap::init() {
    if (initialized_) {
        return SYSTEM_ERROR_NONE;
    }
    // Access wifiNetworkManager() to make sure that RealtekNcpClient is initialized
    // and WiFi stack has been initialized as well, as there is a dependency on its state
    // for btgap to function correctly.
    const auto mgr = wifiNetworkManager();
    CHECK_TRUE(mgr, SYSTEM_ERROR_INTERNAL);

    state_.raw = 0;

    SCOPE_GUARD({
        if (!initialized_) {
            stop();
        }
    });

    RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, ENABLE);

    CHECK_TRUE(os_semaphore_create(&scanSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(os_semaphore_create(&stateSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    // FreeRTOS timers are not supposed to be created with 0 timeout, enabling configASSERT will trigger it
    // We're just creating the timer with fixed period and we're going to change it anyway before starting advertising.
    CHECK_TRUE(os_timer_create(&advTimeoutTimer_, 1000, onAdvTimeoutTimerExpired, this, true, nullptr) == 0, SYSTEM_ERROR_INTERNAL);

    gap_config_max_le_link_num(MAX_LINK_COUNT);
    gap_config_max_le_paired_device(MAX_LINK_COUNT);

    rtwCoexRunDisable();

    CHECK_TRUE(bte_init(), SYSTEM_ERROR_INTERNAL);
    bt_coex_init();

    CHECK_TRUE(le_gap_init(MAX_LINK_COUNT), SYSTEM_ERROR_INTERNAL);
    uint8_t mtuReq = true;
    CHECK_RTL(le_set_gap_param(GAP_PARAM_SLAVE_INIT_GATT_MTU_REQ, sizeof(mtuReq), &mtuReq));
    CHECK(setAppearance(GAP_GATT_APPEARANCE_UNKNOWN));
    CHECK(setDeviceName(devName_, devNameLen_));
    CHECK(setAdvertisingParameters(&advParams_));
    CHECK(setScanParams(&scanParams_));

    constexpr uint8_t zeros[BLE_SIG_ADDR_LEN] = {0,0,0,0,0,0};
    if (!memcmp(addr_.addr, zeros, BLE_SIG_ADDR_LEN)) {
        CHECK(setDeviceAddress(nullptr));
    } else {
        CHECK(setDeviceAddress(&addr_));
    }

    /* register gap message callback */
    le_register_app_cb(gapEventCallback);

    CHECK(BleGatt::getInstance().init());

    initialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleGap::start() {
    if (btStackStarted_) {
        return SYSTEM_ERROR_NONE;
    }

    CHECK(init());

    SCOPE_GUARD({
        if (!btStackStarted_) {
            stop();
        }
    });

    // NOTE: we will miss some of the initial events between bte_init() and when we start the event dispatcher
    CHECK(BleEventDispatcher::getInstance().start());
    // NOTE: we have to wait for the BLE stack to get initialized otherwise other operations
    // with it may cause race conditions, memory leaks and other problems
    CHECK(waitState(BleGapDevState().init(GAP_INIT_STATE_STACK_READY), BLE_STATE_DEFAULT_TIMEOUT, true /* force poll */));
    btStackStarted_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleGap::stop() {
    // NOTE: ignoring errors
    if (btStackStarted_) {
        // NOTE: we have to wait for the BLE stack to get initialized otherwise other operations
        // with it may cause race conditions, memory leaks and other problems
        waitState(BleGapDevState().init(GAP_INIT_STATE_STACK_READY), BLE_STATE_DEFAULT_TIMEOUT, true /* force poll */);
        disconnect();
        if (isAdvertising_) {
            // This will also wait for advertisements to stop
            stopAdvertising();
        }

        if (isScanning_) {
            stopScanning();
            le_scan_stop(); // Just in case
        }

        // Prevent BLE stack from generating coexistence events, otherwise we may leak memory
        gap_register_vendor_cb([](uint8_t cb_type, void *p_cb_data) -> void {
        });
        {
            // This call makes rtw_coex_run_enable(123, false) not cleanup the mutex
            // which might be still accessed by other coexistence tasks
            // but still allows rtw_coex_bt_enable to deinitialize BT coexistence.
            // Subsequently we restore the state with rtwCoexRunEnable() and rtw_coex_wifi_enable
            // will call into rtw_coex_run_enable(123, false) which will finally cleanup the mutex
            rtwCoexRunDisable();
            rtw_coex_bt_enable(*(void**)rltk_wlan_info[0].dev->priv, 0);
            HAL_Delay_Milliseconds(100);
            rtwCoexRunEnable();
            rtw_coex_wifi_enable(*(void**)rltk_wlan_info[0].dev->priv, 0);
            rtwCoexRunDisable();
            rtw_coex_wifi_enable(*(void**)rltk_wlan_info[0].dev->priv, 1);
            rtwCoexCleanup();
        }
    }
    bte_deinit();
    BleEventDispatcher::getInstance().stop();

    initialized_ = false;
    btStackStarted_ = false;

    if (scanSemaphore_) {
        os_semaphore_destroy(scanSemaphore_);
        scanSemaphore_ = nullptr;
    }
    if (stateSemaphore_) {
        os_semaphore_destroy(stateSemaphore_);
        stateSemaphore_ = nullptr;
    }
    if (advTimeoutTimer_) {
        os_timer_destroy(advTimeoutTimer_, nullptr);
        advTimeoutTimer_ = nullptr;
    }

    RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, DISABLE);
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAppearance(uint16_t appearance) const {
    CHECK_RTL(le_set_gap_param(GAP_PARAM_APPEARANCE, sizeof(appearance), &appearance));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setDeviceName(const char* deviceName, size_t len) {
    if (deviceName == nullptr || len == 0) {
        size_t len = CHECK(get_device_name(devName_, sizeof(devName_))); // null-terminated
        devNameLen_ = std::min(len, sizeof(devName_) - 1);
    } else {
        devNameLen_ = std::min(len, sizeof(devName_) - 1);
        memcpy(devName_, deviceName, devNameLen_);
        devName_[devNameLen_] = '\0';
    }
    CHECK_RTL(le_set_gap_param(GAP_PARAM_DEVICE_NAME, std::min(BLE_MAX_DEV_NAME_LEN, (int)devNameLen_), (void*)devName_));
    return SYSTEM_ERROR_NONE;
}

