particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleGap::waitState(BleGapDevState state, system_tick_t timeout, bool forcePoll) {
    auto current = BleGapDevState(getState());
    if (forcePoll || current.isNotInitialized() || !btStackStarted_) {
        // Poll, as some of the initial events are missing
        RtlGapDevState s;
        auto start = hal_timer_millis(nullptr);
        while (hal_timer_millis(nullptr) - start < timeout) {
            CHECK_RTL(le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state));
            if (BleGapDevState(s).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
            HAL_Delay_Milliseconds(BLE_WAIT_STATE_POLL_PERIOD_MS);
        }
    } else {
        auto end = hal_timer_millis(nullptr) + timeout;
        for (auto now = hal_timer_millis(nullptr); now < end; now = hal_timer_millis(nullptr)) {
            os_semaphore_take(stateSemaphore_, end - now, false);
            if (BleGapDevState(getState()).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
        }
    }
    LOG(ERROR, "Timeout waiting state");
    return SYSTEM_ERROR_TIMEOUT;
}

void BleGap::handleDevStateChanged(T_GAP_DEV_STATE newState, uint16_t cause) {
    LOG(TRACE, "GAP state updated, init:%d, adv:%d, adv-sub:%d, scan:%d, conn:%d, cause:%d",
                        newState.gap_init_state, newState.gap_adv_state, newState.gap_adv_sub_state, newState.gap_scan_state, newState.gap_conn_state, cause);
    RtlGapDevState nState;
    nState.state = newState;
    // NOTE: this event is generated before the connection is established
    if (newState.gap_adv_state != state_.state.gap_adv_state) {
        if (newState.gap_adv_state == GAP_ADV_STATE_IDLE && newState.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN) {
            stopAdvertising(false);
        }
    }
    state_.raw = nState.raw;
    os_semaphore_give(stateSemaphore_, false);
}

void BleGap::handleConnectionStateChanged(uint8_t connHandle, T_GAP_CONN_STATE newState, uint16_t discCause) {
    if (newState == GAP_CONN_STATE_CONNECTING) {
        connecting_ = true;
    } else {
        connecting_ = false;
    }
    switch (newState) {
        case GAP_CONN_STATE_CONNECTING: {
            LOG_DEBUG(TRACE, "Connecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTING: {
            LOG_DEBUG(TRACE, "Disconnecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTED: {
            connInfo_.conn_handle = BLE_INVALID_CONN_HANDLE;
            if ((discCause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE)) && (discCause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE))) {
                // placeholder
            }
            LOG_DEBUG(TRACE, "[BLE peripheral] Disconnected, handle:%d, cause:0x%x, re-start ADV", connHandle, discCause);
            for (const auto& callback : periphEvtCallbacks_) {
                if (callback.first) {
                    hal_ble_link_evt_t evt = {};
                    evt.type = BLE_EVT_DISCONNECTED;
                    evt.conn_handle = connHandle;
                    evt.params.disconnected.reason = (uint8_t)discCause;
                    callback.first(&evt, callback.second);
                }
            }
            BleGatt::getInstance().removeSubscriber(connHandle);
            // FIXME: check whether it's enabled?
            startAdvertising(false);
            break;
        }
        case GAP_CONN_STATE_CONNECTED: {
            hal_ble_conn_params_t connParams = {};
            connParams.version = BLE_API_VERSION;
            connParams.size = sizeof(hal_ble_conn_params_t);
            hal_ble_addr_t peerAddr = {};
            peerAddr.addr_type = BLE_SIG_ADDR_TYPE_PUBLIC;
            le_get_conn_addr(connHandle, peerAddr.addr, (uint8_t *)&peerAddr.addr_type);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connParams.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connParams.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "[BLE peripheral] Connected, interval:0x%x, latency:0x%x, timeout:0x%x",
                            connParams.max_conn_interval, connParams.slave_latency, connParams.conn_sup_timeout);
            connInfo_.version = BLE_API_VERSION;
            connInfo_.size = sizeof(hal_ble_conn_info_t);
            connInfo_.role = BLE_ROLE_PERIPHERAL;
            connInfo_.conn_handle = connHandle;
            connInfo_.conn_params = connParams;
            connInfo_.address = peerAddr;
            connInfo_.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
            for (const auto& callback : periphEvtCallbacks_) {
                if (callback.first) {
                    hal_ble_link_evt_t evt = {};
                    evt.type = BLE_EVT_CONNECTED;
                    evt.conn_handle = connInfo_.conn_handle;
                    evt.params.connected.info = &connInfo_;
                    callback.first(&evt, callback.second);
                }
            }
            break;
        }
        default: break;
    }
}

void BleGap::handleMtuUpdated(uint8_t connHandle, uint16_t mtuSize) {
    // FIXME: adding log in this function causes BLE deadlock, but not in the wiring callback!!!
    // LOG_DEBUG(TRACE, "handleMtuUpdated: handle:%d, mtu_size:%d", connHandle, mtuSize);
    if (connHandle != connInfo_.conn_handle) {
        return;
    }
    connInfo_.att_mtu = mtuSize;
    for (const auto& callback : periphEvtCallbacks_) {
        if (callback.first) {
            hal_ble_link_evt_t evt = {};
            evt.type = BLE_EVT_ATT_MTU_UPDATED;
            evt.conn_handle = connHandle;
            evt.params.att_mtu_updated.att_mtu_size = mtuSize;
            callback.first(&evt, callback.second);
        }
    }
}

void BleGap::handleConnParamsUpdated(uint8_t connHandle, uint8_t status, uint16_t cause) {
    if (connHandle != connInfo_.conn_handle) {
        return;
    }
    switch (status) {
        case GAP_CONN_PARAM_UPDATE_STATUS_SUCCESS: {
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connInfo_.conn_params.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connInfo_.conn_params.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connInfo_.conn_params.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connInfo_.conn_params.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "handleConnParamsUpdated: update success: interval:0x%x, latency:0x%x, timeout:0x%x",
                            connInfo_.conn_params.max_conn_interval, connInfo_.conn_params.slave_latency, connInfo_.conn_params.conn_sup_timeout);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_FAIL: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update failed: cause 0x%x", cause);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_PENDING: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update pending: conn_id %d", connHandle);
            break;
        }
        default: break;
    }
}

